Table of Contents
 Class CrossSectionThermalAttribute
Namespace
IdeaRS.OpenModel.CrossSection
Assembly
IdeaRS.OpenModel.dll
Cross-section thermal attribute
[OpenModelClass("CI.StructModel.Libraries.CrossSection.ComponentsThermalAttribute,CI.CrossSection")]
public class CrossSectionThermalAttribute : OpenAttribute
Inheritance
object
OpenObject
OpenAttribute
CrossSectionThermalAttribute
Inherited Members
 OpenAttribute.Element
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Examples
This sample shows how to create thermal attributes on cross-section.
//Creating the model
OpenModel openModel = new OpenModel();
Set thermal definition - on component 0,
CrossSectionThermalAttribute thermalAttr = new CrossSectionThermalAttribute();
thermalAttr.Element = new ReferenceElement(css);
CrossSectionComponentThermalData thermalComp = new CrossSectionComponentThermalData();
thermalComp.MoistureContent = 0.015;
thermalComp.ThermalConductivityLimit = ThermalConductivityLimit.Lower;
thermalComp.ComponentIndex = 0;
thermalAttr.Components.Add(thermalComp);
openModel.AddObject(thermalAttr);
Constructors
 CrossSectionThermalAttribute()
Constructor
public CrossSectionThermalAttribute()
Properties
 Components
List of components
public List<CrossSectionComponentThermalData> Components { get; set; }
Property Value
List<CrossSectionComponentThermalData>
 Edit this page